{"class_name": "Sequential", "keras_version": "2.4.0", "backend": "tensorflow", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 8], "ragged": false, "name": "input_1", "sparse": false}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_constraint": null, "trainable": true, "name": "dense", "units": 64, "use_bias": true, "activation": "tanh", "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "trainable": true, "dtype": "float32", "noise_shape": null, "name": "dropout"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_constraint": null, "trainable": true, "name": "dense_1", "units": 64, "use_bias": true, "activation": "tanh", "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "trainable": true, "dtype": "float32", "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_constraint": null, "trainable": true, "name": "dense_2", "units": 1295, "use_bias": true, "activation": "tanh", "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "trainable": true, "dtype": "float32", "noise_shape": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_constraint": null, "trainable": true, "name": "dense_3", "units": 1295, "use_bias": true, "activation": "exp_advanced", "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}]}}