{"config": {"layers": [{"class_name": "InputLayer", "config": {"sparse": false, "ragged": false, "name": "input_1", "dtype": "float32", "batch_input_shape": [null, 8]}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 64, "use_bias": true, "name": "dense", "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_constraint": null, "activation": "tanh", "kernel_constraint": null, "trainable": true, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout", "rate": 0.5, "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 64, "use_bias": true, "name": "dense_1", "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_constraint": null, "activation": "tanh", "kernel_constraint": null, "trainable": true, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.5, "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 35, "use_bias": true, "name": "dense_2", "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_constraint": null, "activation": "tanh", "kernel_constraint": null, "trainable": true, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_2", "rate": 0.5, "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 35, "use_bias": true, "name": "dense_3", "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "bias_constraint": null, "activation": "exp_advanced", "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "name": "sequential"}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.4.0"}