{"keras_version": "2.4.0", "class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 32], "ragged": false}}, {"class_name": "Dense", "config": {"activity_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "units": 64, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "trainable": true, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "use_bias": true, "kernel_constraint": null, "name": "dense"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "dropout"}}, {"class_name": "Dense", "config": {"activity_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "units": 64, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "trainable": true, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "use_bias": true, "kernel_constraint": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "units": 1295, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "trainable": true, "kernel_regularizer": {"class_name": "L2", "config": {"l2": 9.999999747378752e-06}}, "use_bias": true, "kernel_constraint": null, "name": "dense_2"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "units": 1295, "activation": "exp_advanced", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "name": "dense_3"}}]}}