{"config": {"layers": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 32], "ragged": false, "name": "input_1"}, "class_name": "InputLayer"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "use_bias": true, "activity_regularizer": {"config": {"l2": 9.999999747378752e-06}, "class_name": "L2"}, "activation": "tanh", "name": "dense", "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06}, "class_name": "L2"}, "units": 64, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "rate": 0.5, "name": "dropout", "dtype": "float32", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "use_bias": true, "activity_regularizer": {"config": {"l2": 9.999999747378752e-06}, "class_name": "L2"}, "activation": "tanh", "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06}, "class_name": "L2"}, "units": 64, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "rate": 0.5, "name": "dropout_1", "dtype": "float32", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "use_bias": true, "activity_regularizer": {"config": {"l2": 9.999999747378752e-06}, "class_name": "L2"}, "activation": "tanh", "name": "dense_2", "kernel_constraint": null, "kernel_regularizer": {"config": {"l2": 9.999999747378752e-06}, "class_name": "L2"}, "units": 1295, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "rate": 0.5, "name": "dropout_2", "dtype": "float32", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "use_bias": true, "activity_regularizer": null, "activation": "exp_advanced", "name": "dense_3", "kernel_constraint": null, "kernel_regularizer": null, "units": 1295, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}], "name": "sequential"}, "keras_version": "2.4.0", "class_name": "Sequential", "backend": "tensorflow"}