{"backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 8], "ragged": false, "name": "input_1", "dtype": "float32"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 64, "bias_constraint": null, "use_bias": true, "activation": "tanh", "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "name": "dense", "trainable": true, "dtype": "float32"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "seed": null, "name": "dropout", "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 64, "bias_constraint": null, "use_bias": true, "activation": "tanh", "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "name": "dense_1", "trainable": true, "dtype": "float32"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "seed": null, "name": "dropout_1", "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 1295, "bias_constraint": null, "use_bias": true, "activation": "tanh", "kernel_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "activity_regularizer": {"class_name": "L2", "config": {"l2": 0.0010000000474974513}}, "name": "dense_2", "trainable": true, "dtype": "float32"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "seed": null, "name": "dropout_2", "trainable": true, "dtype": "float32"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 1295, "bias_constraint": null, "use_bias": true, "activation": "exp_advanced", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_3", "trainable": true, "dtype": "float32"}}], "name": "sequential"}, "keras_version": "2.4.0", "class_name": "Sequential"}