{"keras_version": "2.4.0", "config": {"name": "sequential", "layers": [{"config": {"name": "input_1", "sparse": false, "ragged": false, "batch_input_shape": [null, 8], "dtype": "float32"}, "class_name": "InputLayer"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "activation": "tanh", "name": "dense", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513}, "class_name": "L2"}, "units": 64, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": {"config": {"l2": 0.0010000000474974513}, "class_name": "L2"}, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"name": "dropout", "rate": 0.5, "trainable": true, "seed": null, "noise_shape": null, "dtype": "float32"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "activation": "tanh", "name": "dense_1", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513}, "class_name": "L2"}, "units": 64, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": {"config": {"l2": 0.0010000000474974513}, "class_name": "L2"}, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "rate": 0.5, "trainable": true, "seed": null, "noise_shape": null, "dtype": "float32"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "activation": "tanh", "name": "dense_2", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513}, "class_name": "L2"}, "units": 35, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": {"config": {"l2": 0.0010000000474974513}, "class_name": "L2"}, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.5, "trainable": true, "seed": null, "noise_shape": null, "dtype": "float32"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "activation": "exp_advanced", "name": "dense_3", "kernel_regularizer": null, "units": 35, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "dtype": "float32"}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential"}